exts/sentry/src/InformationRegisters/Sentry_НастройкиПодключенияКСервису/Sentry_НастройкиПодключенияКСервису.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Sentry_НастройкиПодключенияКСервису</name>
  <resources>
    <name>АдресСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗащищенныйИнтернетПротокол</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>СохраненныйПутьДоИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньЛогирования</name>
    <type>
      <types>EnumRef.Sentry_УровниЛогирования</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалВыгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

exts/sentry/src/Enums/Sentry_УровниЛогирования/Sentry_УровниЛогирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Sentry_УровниЛогирования</name>
  <enumValues>
    <name>Ошибки</name>
  </enumValues>
  <enumValues>
    <name>Предупреждения</name>
  </enumValues>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Примечания</name>
  </enumValues>
</mdclass:Enum>

exts/sentry/src/CommonModules/Sentry_РегламентноеЗаданиеСервер/Module.bsl
#Область ПрограммныйИнтерфейс


Процедура ОтправкаЖурналаРегистрацииВSentry() Экспорт
	
	Отказ = Ложь;
	
	ПередВыполнениемОсновногоРегламентногоЗадания(Отказ); 
	
	МассивРеглЗаданий = Sentry_РегламентноеЗаданиеСервер.ПолучитьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗаданияSentry());
	Если МассивРеглЗаданий.Количество() > 0 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не найдено регламентное задание. Проверьте, включены ли в базе регламентные задания и выполните подключение снова.'"); 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецЕсли;	

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РеглЗадание = МассивРеглЗаданий[0];
	
	Настройки = РегистрыСведений.Sentry_НастройкиПодключенияКСервису.НастройкиСервиса();
	Если НЕ ЗначениеЗаполнено(Настройки.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала = Константы.Sentry_ВремяПоследнегоОбмена.Получить();
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДата() - РеглЗадание.Расписание.ПериодПовтораВТечениеДня;
	КонецЕсли;
	ДатаОкончания = ТекущаяДата();
	
	МассивУровнейЖурнала = ПолучитьМассивУровнейЖурнала(Настройки.УровеньЛогирования);	
	МассивТаблицЖурнала = Новый Массив;
	
	// получим все события и запомним дату перед выгрузкой
	Для Каждого УровеньЖурнала Из МассивУровнейЖурнала Цикл
		
		ОтборЖурнала = Новый Структура();
		ОтборЖурнала.Вставить("ДатаНачала", ДатаНачала);
		ОтборЖурнала.Вставить("ДатаОкончания", ДатаОкончания);
		ОтборЖурнала.Вставить("Уровень", УровеньЖурнала);
		
		СобытияЖурналаТекущийДень = Новый ТаблицаЗначений;
		ВыгрузитьЖурналРегистрации(СобытияЖурналаТекущийДень, ОтборЖурнала, , , );
		СобытияЖурналаТекущийДень.Сортировать("ПредставлениеМетаданных, ПредставлениеСобытия");
		
		МассивТаблицЖурнала.Добавить(СобытияЖурналаТекущийДень);
		
	КонецЦикла;
		
	Для Каждого Журнал Из МассивТаблицЖурнала Цикл
		Для Каждого СтрокаЖурнала Из Журнал Цикл
			
			Sentry_ОбменДаннымиСервер.ОтправитьОшибкуВSentry(СтрокаЖурнала, Настройки.ЗащищенныйИнтернетПротокол, Настройки.АдресСервиса, Настройки.Порт, Настройки.Ключ, Настройки.ПроектID);
			
		КонецЦикла;
	КонецЦикла;
	
	Константы.Sentry_ВремяПоследнегоОбмена.Установить(ДатаОкончания);
	
	
КонецПроцедуры

// Ищет регламентное задание для обмена с Sentry по его уникальному идентификатору. 
// Создает новое задание, если оно не найдено.
//
// Параметры:
//	Настройки - СправочникОбъект.Sentry_НастройкиПодключения - создаваемые настройки подключения к Sentry.
//	Расписание - РасписаниеРегламентногоЗадания - расписание для создания регламентного задания.
//
// Возвращаемое значение:
//	РегламентноеЗадание
//
Функция СоздатьРегламентноеЗадание(РегламентноеЗаданиеGUID, Расписание) Экспорт
	
	Задание = ПолучитьРегламентноеЗаданиеПоGUID(РегламентноеЗаданиеGUID);
	Если Задание = Неопределено Тогда
		МетаданныеЗадания = Метаданные.РегламентныеЗадания.Sentry_ОтправкаЗапросовВСервис;
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеЗадания);
		Задание.Наименование = НаименованиеРегламентногоЗаданияSentry();
		Задание.Использование = Истина;
		Задание.Ключ = КлючРегламентногоЗаданияSentry();
		//Задание.ИмяПользователя = Параметры.ИмяПользователя;
		Задание.ИнтервалПовтораПриАварийномЗавершении = 10;
		Задание.КоличествоПовторовПриАварийномЗавершении = 3;
		//Задание.Параметры = Параметры.Параметры;
		Задание.Расписание = Расписание;
		
		Задание.Записать();
	КонецЕсли;		
	
	Возврат Задание;
	
КонецФункции

// Удаляет ранее созданное регламентное задание Sentry. 
// Выполняется при создании новых настроек подключения к Sentry.
//
// Параметры:
//	ПредыдущиеНастройки - Структура - настройки подключения к Sentry, 
//		см. Sentry_ОбменДаннымиСервер.НастройкиПодключенияSentry()
//
Процедура УдалитьРегламентныеЗадания() Экспорт
	
	МассивРеглЗаданий = ПолучитьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗаданияSentry());
	Для Каждого РеглЗадание Из МассивРеглЗаданий Цикл
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КэшПрограммныхИнтерфейсов");
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Строка(РеглЗадание.УникальныйИдентификатор));
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			Если РеглЗадание <> Неопределено Тогда
				РеглЗадание.Удалить();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла; 
	
КонецПроцедуры	


// Возвращает наименование регламентного задания Sentry.
//
// Возвращаемое значение:
// 	Строка
//
Функция НаименованиеРегламентногоЗаданияSentry() Экспорт
	
	Возврат Метаданные.РегламентныеЗадания.Sentry_ОтправкаЗапросовВСервис.Наименование;
	
КонецФункции 

// Возвращает наименование регламентного задания Sentry.
//
// Возвращаемое значение:
// 	Строка
//
Функция КлючРегламентногоЗаданияSentry() Экспорт
	
	Возврат Метаданные.РегламентныеЗадания.Sentry_ОтправкаЗапросовВСервис.Ключ;
	
КонецФункции

Функция ПолучитьРегламентноеЗаданиеПоGUID(РегламентноеЗаданиеGUID) Экспорт
	
	Попытка
		Возврат РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции 

Функция ПолучитьРегламентноеЗаданиеПоКлючу(РегламентноеЗаданиеКлюч) Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("Ключ", Sentry_РегламентноеЗаданиеСервер.КлючРегламентногоЗаданияSentry());
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Возврат МассивЗаданий;

КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередВыполнениемОсновногоРегламентногоЗадания(Отказ)

	СохраненныйПутьДоИнформационнойБазы = СохраненныйПутьДоИнформационнойБазы();	
	ПредставлениеИнформационнойБазы = Sentry_ОбменДаннымиПовтИсп.СтрокаСоединенияСБД();
	
	Если ЗначениеЗаполнено(СохраненныйПутьДоИнформационнойБазы)
		И НРег(СохраненныйПутьДоИнформационнойБазы) <> НРег(ПредставлениеИнформационнойБазы) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция СохраненныйПутьДоИнформационнойБазы() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат РегистрыСведений.Sentry_НастройкиПодключенияКСервису.ЗначениеНастройки("СохраненныйПутьДоИнформационнойБазы");

КонецФункции

Функция ПолучитьМассивУровнейЖурнала(УровеньЛогирования)
	
	МассивУровнейЛогирования = Новый Массив;
	МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Ошибка);
	
	Если УровеньЛогирования = Перечисления.Sentry_УровниЛогирования.Предупреждения Тогда
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Предупреждение);	
	ИначеЕсли УровеньЛогирования = Перечисления.Sentry_УровниЛогирования.Информация Тогда
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Предупреждение);	
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Информация);	
	ИначеЕсли УровеньЛогирования = Перечисления.Sentry_УровниЛогирования.Примечания Тогда
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Предупреждение);	
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Информация);	
		МассивУровнейЛогирования.Добавить(УровеньЖурналаРегистрации.Примечание);	
	КонецЕсли; 

	Возврат МассивУровнейЛогирования
	
КонецФункции
#КонецОбласти
